Repository: 84000/data-translation-memory
Catalog: toh195_84000-the-avalokini-sutra.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྤྱན་རས་གཟིགས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra: Avalokinī

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing in Rājagṛha at Vulture Peak Mountain, together with a great saṅgha of monks and a great many bodhisattva great beings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྣམ་པར་དག་པ་ལ་བཀའ་སྩལ་པ། བློ་གྲོས་རྣམ་པར་དག་པ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: At that time, the Blessed One said to the bodhisattva Pure Intellect, “Pure Intellect, the thus-gone ones are pure because their discipline is pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་ཏིང་ངེ་འཛིན་ཡོངས་སུ་དག་པ་དང་། བཟོད་པ་ཡོངས་སུ་དག་པ་དང་། ཕན་པའི་དངོས་པོ་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their absorption, patience, and beneficence are pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་བྱམས་པ་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their love is pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་སྙིང་རྗེ་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their compassion is pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་དགའ་བ་ཡོངས་སུ་དག་པ་དང་། བཏང་སྙོམས་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their joy and equanimity are pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their liberation and their liberated wisdom are pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་སྟོབས་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their powers are pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་མི་འཇིགས་པ་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་དག་པས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་གོ།
en: Pure Intellect, the thus-gone ones are pure because their fearlessness, buddha qualities, and omniscient wisdom are pure.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་དག་པ་ལ་སུ་ཞིག་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རོལ་མོའི་སྒྲ་དང་། བྱུག་པ་རྣམས་ཀྱིས་བསྟི་སྟང་བྱེད་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ།
en: “Pure Intellect, this being so, the size of the mass of merit generated by someone who honors the pure thus-gone ones with flowers, garlands, perfumes, parasols, banners, flags, music, and ointments cannot be fathomed.

source: དེའི་མཐའ་ནི་ཐེག་པ་གསུམ་པོ་ལས་ཐེག་པ་གང་ཡང་རུང་བས་མྱ་ངན་ལས་འདས་པའི་མཐར་ཐུག་པ་མ་གཏོགས་པར་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཕྱི་མའི་མཐར་ཡང་ཟད་པར་མི་ནུས་སོ།
en: Except for the final passing into nirvāṇa through any of the three vehicles, this heap of merit can never be depleted, even in the future.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that so?

source: བློ་གྲོས་རྣམ་པར་དག་པ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱིས་ཚད་མེད་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་ཡང་ཚད་མེད་དོ། །མཐའ་ཡས་སོ། །བསམ་གྱིས་མི་ཁྱབ་བོ། །མཚུངས་པ་མེད་དོ། །དཔག་ཏུ་མེད་དོ། །གྲངས་མེད་དོ། །དཔག་གིས་མི་ལང་ངོ་། །བརྗོད་དུ་མེད་དོ།
en: Pure Intellect, just as the thus-gone ones are immeasurable in terms of all their buddha qualities, the offerings made to the thus-gone ones are immeasurable, endless, inconceivable, incomparable, unfathomable, incalculable, boundless, and inexpressible.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་སུ་ཞིག་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བཞུགས་ཏེ།
en: “Pure Intellect, consider someone who honors, respects, venerates, worships, and reveres the thus-gone ones who live, thrive, and are well today.

source: འཚོ་ཞིང་གཞེས་པ་ལ་བསྟི་སྟང་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། རི་མོར་བྱེད་པ་དང་། མཆོད་པ་དང་། རྗེད་པ་དང་། ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་ཐ་མ་ལ་སུ་ཞིག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ལ་བསྟི་སྟང་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། རི་མོར་བྱེད་པ་དང་། མཆོད་པ་དང་། རྗེད་པ་དང་། ཡང་དག་པར་སེམས་ཉེ་བར་གཞག་སྟེ་བྱང་ཆུབ་ཏུ་གཞོལ་བའི་སེམས་བསྐྱེད་པས་ཕྱག་འཚལ་བ་དང་། ཕྱག་བྱེད་པ་དང་། བསྟི་སྟང་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། རི་མོར་བྱེད་པ་དང་། མཆོད་པ་དང་། རྗེད་པ་དང་། གསོལ་བ་དང་། བསྔགས་པ་དང་། སྐོར་བ་བྱེད་པ་དེས་ཕན་ཡོན་ལྔ་ཡོངས་སུ་གཟུང་བར་འགྱུར་ཏེ།
en: Then, consider someone who, in the future, during the final five-hundred-year period, honors, respects, venerates, worships, reveres, and holds dear a relic belonging to a thus-gone one who has passed into parinirvāṇa, even if it is as small as a mustard seed. Giving rise to the mind set on awakening, that person will pay homage to, prostrate to, honor, respect, venerate, worship, revere, supplicate, praise, and circumambulate this relic. Both of these persons will gain five benefits.

source: ལྔ་གང་ཞེ་ན།
en: What are these five benefits?

source: དྲན་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། རྟོགས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། མྱུར་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་བར་འགྱུར་བ་དང་། མཐོང་ནས་ཀྱང་དད་པ་སྐྱེད་པར་འགྱུར་བ་སྟེ་ཕན་ཡོན་ལྔ་པོ་དེ་དག་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ།
en: They will be endowed with (1) mindfulness, (2) understanding, and (3) self-respect and propriety; (4) they will quickly meet a blessed buddha; and (5) faith will be born in them upon seeing that buddha. These are the five benefits that they will gain.

source: །དེ་ཆོས་བཞི་དང་ལྡན་པར་འགྱུར་ཏེ།
en: “Those persons will also possess four other qualities.

source: བཞི་གང་ཞེ་ན།
en: What are these four qualities?

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འཛིན་པ་དང་། དེ་ཡང་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་བསྒྲུབ་པ་དང་། བསྒྲུབས་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཉེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེ་བར་འགྱུར་བ་སྟེ།
en: They will uphold the teachings of the thus-gone ones, (2) they will practice in accordance with these teachings, (3) they will come near to the blessed buddhas after having practiced in that way, and (4) they will swiftly be born in a pure buddhafield.

source: ཆོས་བཞི་པོ་དེ་དག་གོ།
en: These are the four qualities.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་མི་རྫི་བར་འགྱུར་ཏེ།
en: “Pure Intellect, if a bodhisattva fulfills four criteria, he or she will not be oppressed by Māra or any divine sons of Māra’s family.

source: རིགས་མཐོ་ཞིང་རིགས་ཆེ་བ་དང་། བཙས་མ་ཐག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡིད་ལ་བྱེད་པ་དང་། ཕྱི་མའི་དུས་ན་དམ་པའི་ཆོས་འཛིན་པ་དང་། རྟག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབ་པར་འགྱུར་བ་སྟེ།
en: Being born in a high and noble family, (2) directing one’s mind toward the blessed buddhas as soon as one is born, (3) upholding the sacred Dharma in later stages of life, and (4) always being blessed by the thus-gone ones, the worthy ones, the perfect buddhas.

source: བློ་གྲོས་རྣམ་པར་དག་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་མི་རྫི་བར་འགྱུར་རོ།
en: Pure Intellect, if a bodhisattva fulfills these four criteria, they will not be oppressed by Māra or any divine sons of Māra’s family.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: At that moment, the Blessed One uttered these verses: “Whoever arouses the mind set on awakening,

source: །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར།
en: For the benefit of all beings,

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ནས།
en: And circumambulates the stūpa

source: །འཇིག་རྟེན་མགོན་གྱི་མཆོད་རྟེན་ལ། །སུ་ཞིག་སྐོར་བ་བྱེད་པ་ནི།
en: Of a protector of the world,

source: །ཚེ་རབས་དག་ནི་ཐམས་ཅད་དུ། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: “Will, throughout all his lives,

source: །དྲན་དང་ལྡན་ཞིང་བློ་གྲོས་ལྡན།
en: Be mindful, intelligent,

source: །བསོད་ནམས་ལྡན་ཞིང་འཇིགས་མེད་འགྱུར།
en: Meritorious, and fearless While engaging in bodhisattva conduct.

source: །མཆོད་རྟེན་བསྐོར་བ་བྱས་ན་ནི།
en: “If someone circumambulates a stūpa,

source: །ཚེ་རབས་དག་ནི་ཐམས་ཅད་དུ།
en: He will, throughout all his lives,

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །སྲིན་པོ་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར།
en: Be worshiped by the gods, The nāgas, the yakṣas, and the rākṣasas. “He will be free from the eight unfree states

source: །ངས་ནི་གང་དག་བསྟན་པ་ཡི། །མི་ཁོམ་བརྒྱད་པོ་དེ་དག་སྤོང་།
en: That I have described, And will enjoy a unique freedom—

source: །སངས་རྒྱས་འབྱུང་བ་རབ་མཛེས་པ།
en: The excellent circumstance of a buddha’s coming.

source: །མཉེས་པར་བྱེད་འདི་དལ་བ་གཅིག །མདོག་ལྡན་གཟུགས་ནི་ཕུན་སུམ་ཚོགས།
en: “With a beautiful complexion and an attractive appearance,

source: །མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ་དང་། །མཐུ་དང་སྟོབས་དང་ལྡན་པར་འགྱུར།
en: Elegantly adorned with the marks, He will be strong and powerful,

source: །ལེ་ལོ་ཅན་དུ་དེ་མི་འགྱུར།
en: And will not fall under the influence of laziness.

source: །དེ་ནི་ཕྱུག་ཅིང་ནོར་ཆེར་འགྱུར།
en: “He will be wealthy, prosperous,

source: །བསོད་ནམས་ལྡན་ཞིང་རྫི་བ་མེད།
en: Meritorious, and invincible.

source: །འཇིག་རྟེན་སྒྲོན་མ་མཉེས་བྱས་ནས།
en: He will please the lights of the world,

source: །ཡང་དང་ཡང་དུ་བསྟི་སྟང་བྱེད།
en: And honor them again and again.

source: །བདག་མེད་སྟོང་པའི་ཆོས་ཐོས་ནས།
en: “Upon hearing the doctrines of selflessness and emptiness,

source: །དེ་ནི་ཆོས་ལ་རྨོངས་མི་འགྱུར།
en: He will not be deluded about the Dharma,

source: །མྱུར་དུ་དད་པ་འཐོབ་འགྱུར་ཞིང་།
en: But will swiftly develop faith,

source: །ཆོས་དོན་ཇི་བཞིན་མཁས་པར་འགྱུར།
en: And correctly master the Dharma’s meaning.

source: །ཚོང་དཔོན་ཁྱིམ་དང་རྒྱས་པ་དང་། །ཕྱུག་པོ་རྣམས་སུ་སྐྱེ་བར་འགྱུར།
en: “Born into prosperous And wealthy merchant households,

source: །དཔའ་ཞིང་སྦྱིན་པའི་བདག་པོར་འགྱུར།
en: He will be a heroic benefactor,

source: །གཏོང་བ་བཏང་ཞིང་སེར་སྣ་མེད།
en: Generous and free from greed.

source: །འཛམ་བུའི་གླིང་ན་གང་ཡང་རུང་། །ཁྱད་པར་ཅན་གྱི་རིགས་མཛེས་པ།
en: “Anywhere in the world,

source: །དེར་ནི་བརྟན་པ་དེ་སྐྱེ་སྟེ།
en: This upstanding person will always be born In distinguished and noble families,

source: །དམའ་བ་དག་ནི་རྣམ་པར་སྤངས།
en: Having escaped inferior circumstances.

source: །སྐྱེ་བ་ཐམས་ཅད་ཀུན་ཏུ་ཡང་།
en: He will, throughout all his lives,

source: །དབང་ཆེར་གྲགས་པའི་ཁྱིམ་བདག་དང་། །དཔལ་དང་གཟི་བརྗིད་ལྡན་པར་འགྱུར།
en: Be reborn as an influential, renowned, Illustrious, and splendid householder.

source: །བྲམ་ཟེ་སཱ་ལ་ཆེ་འདྲ་དང་། །ཚུལ་ཁྲིམས་ལྡན་ཞིང་མང་ཐོས་དང་། །རྒྱལ་རིགས་སཱ་ལ་ཆེ་འདྲ་དང་། །ཕྱུག་ཅིང་ནོར་ཆེན་ལྡན་པར་འགྱུར།
en: “He will become a great Brahmin householder, Who is disciplined and learned. He will become a great Kṣatriya householder, Who is wealthy and affluent. “He will become a righteous king,

source: །རིས་བསྐོར་རྒྱ་མཚོ་ཚུན་ཆད་ཀྱི།
en: A sovereign of the four continents,

source: །ས་ཀུན་ལ་ནི་གང་སྨོན་པ།
en: Who rules the entire land according to his wishes,

source: །གླིང་བཞི་དག་གི་དབང་ཕྱུག་བླ།
en: As far as the ocean and the surrounding mountains.

source: །རྒྱལ་པོ་ཆོས་དང་ལྡན་པར་འགྱུར། །འཁོར་ལོས་སྒྱུར་བ་རྫུ་འཕྲུལ་ཆེ།
en: “He will become a universal monarch possessing miraculous powers

source: །རིན་ཆེན་བདུན་དང་ལྡན་པར་འགྱུར།
en: And the seven precious things.

source: །རྒྱལ་སྲིད་གནས་ནས་སངས་རྒྱས་ལ།
en: Ruling over his kingdom,

source: །འདི་ནས་ཤི་འཕོས་མཐོ་རིས་སུ།
en: “After he dies and transfers, he will proceed to the higher realms,

source: །སོང་ནས་སངས་རྒྱས་བསྟན་ལ་དད།
en: Where he will have faith in the Buddha’s teachings. He will become Śakra, lord of the gods,

source: །ལྷུན་པོའི་ཟོམ་གྱི་དབང་ཕྱུག་པོ།
en: Ruling from the summit of Mount Meru.

source: །ལྷ་ཡི་དབང་པོ་བརྒྱ་བྱིན་འགྱུར།
en: “He will become the lord of the gods of the Heaven Free from Strife,

source: །ལྷ་དབང་ཤིན་ཏུ་འཐབ་བྲལ་དང་། །དེ་བཞིན་དུ་ནི་དགའ་ལྡན་དང་། །ལྷ་དབང་ཤིན་ཏུ་འཕྲུལ་དགའ་དང་། །དབང་སྒྱུར་འཇིགས་པ་མེད་པར་འགྱུར།
en: The lord of the gods of the Heaven of Joy, And the lord of the gods of the Heaven of Delighting in Emanations. He will be a fearless ruler.

source: །མཆོད་རྟེན་བསྐོར་བ་བྱས་ན་ནི། །དེ་ནི་ཚངས་པའི་འཇིག་རྟེན་དུ།
en: “By circumambulating a stūpa,

source: །ཚངས་པའི་དབང་ཕྱུག་མཁས་འགྱུར་ཞིང་།
en: He will become the wise lord Brahmā,

source: །ལྷ་རྣམས་བྱེ་བས་མཆོད་པར་འགྱུར།
en: Who is worshiped by ten million gods

source: །འཇིག་རྟེན་མགོན་གྱི་མཆོད་རྟེན་ལ། །མི་གང་སྐོར་བ་བྱེད་པ་ཡི།
en: In the Brahmā world.

source: །བསྔགས་པ་བསྐལ་པ་བྱེ་བར་ཡང་།
en: “Ten million eons would not suffice

source: །བརྗོད་པས་ཟད་པར་བྱ་མི་ནུས།
en: To proclaim the praises

source: །སུ་ཞིག་བྱང་ཆུབ་སེམས་བསྐྱེད་ནས།
en: Of a person who circumambulates

source: །སྟོན་པའི་མཆོད་རྟེན་ཕྱག་འཚལ་བ།
en: The stūpa of a protector of the world. “Whoever prostrates to the stūpa of a teacher, After having given rise to the mind set on awakening,

source: །དེ་ནི་བསྐལ་པ་བྱེ་བར་ཡང་།
en: Will never, in ten million eons,

source: །ནམས་ཀྱང་ལོང་ཞིང་འཐེང་མི་འགྱུར།
en: Become blind or crippled. “Someone who circumambulates

source: །འཇིག་རྟེན་མགོན་གྱི་མཆོད་རྟེན་ལ།
en: The stūpa of a protector of the world

source: །མངོན་དུ་སྐོར་བ་བྱེད་པ་ནི།
en: Will obtain flawless eyes,

source: །བུང་བ་སྔོན་པོ་མཛེས་འདྲ་ཡི། །རྣམ་པར་དག་པའི་མིག་འཐོབ་འགྱུར།
en: That are as beautifully dark as bees.

source: །དེ་ནི་ངེས་པར་རྟག་ཏུ་ཡང་།
en: He is certain to always

source: །འཐུན་པའི་དོན་ཀུན་འཐོབ་འགྱུར་ཞིང་།
en: Encounter everything that is conducive,

source: །དོན་མིན་རྣམས་ནི་སྤང་བར་འགྱུར།
en: And to always discard what is not conducive.

source: །མཐུ་དང་སྟོབས་དང་ལྡན་པར་འགྱུར།
en: He will be strong and powerful.

source: །དེ་ནི་ལེ་ལོ་མེད་འགྱུར་ཞིང་།
en: Without falling under the influence of laziness,

source: །རྟག་ཏུ་བག་ཡོད་ལྡན་པར་འགྱུར།
en: He will always be conscientious.

source: །མཆོད་རྟེན་བསྐོར་བར་བྱས་ན་ནི།
en: “If someone circumambulates a stūpa,

source: །བརྩོན་འགྲུས་བརྟན་ཞིང་མཐུ་བརྟན་ལ།
en: He will be resolutely diligent, strong,

source: །བརྟན་ཞིང་རྣམ་པར་གནོན་བརྟན་དང་། །དེ་ནི་མྱུར་དུ་མཁས་པར་འགྱུར།
en: Staunch, and grounded. Such a person will swiftly become learned.

source: །མེ་དང་དུག་དང་མཚོན་གྱིས་དེ།
en: “Fire, poison, and weapons

source: །ནམས་ཀྱང་འཆི་དུས་བྱེད་མི་འགྱུར།
en: Will never cause his demise.

source: མཁས་པ་ཚེ་ནི་རྫོགས་རྫོགས་སུ། །ཟད་པར་བྱས་ནས་འཆི་དུས་བྱེད།
en: This wise one will only die When his lifespan is exhausted.

source: །ཕོ་བྲང་འཁོར་དང་ཡུལ་འཁོར་དང་། །གྲོང་རྡལ་རྣམས་སུ་ལོངས་སྤྱོད་དང་། །གཟུགས་ཀྱིས་ཁྱད་པར་འཕགས་པར་འགྱུར།
en: He will enjoy palaces, retinues, Lands, and towns, And be distinguished by his physical appearance.

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: “As he engages in bodhisattva conduct,

source: །དེ་ནི་འདོད་པ་མི་སྟེན་ཅིང་།
en: He will not follow his desires,

source: །ལུས་ཀྱང་གཙང་ལ་གོས་གཙང་ཞིང་།
en: But will maintain the cleanliness of his body and clothes,

source: །གཙང་མའི་ཆོས་ལ་གནས་པར་འགྱུར།
en: And observe the pure Dharma.

source: །བློ་གྲོས་རྣམ་པར་དག་པ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་གང་དག་གིས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་མཐོང་ནས་དད་པ་སྐྱེད་དེ། པུས་མོ་གཉི་གའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་ཕྱག་འཚལ་ཞིང་ཕྱག་བྱེད་དེ།
en: “Pure Intellect, upon seeing the stūpa of a thus-gone one, a follower of the bodhisattva vehicle may develop faith and, kneeling on both knees, pay homage and prostrate to it.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་པ་དེ་ཅི་འདྲ་བར་བདག་གི་ལུས་ཀྱང་དེ་འདྲ་བར་གྱུར་ཅིག་ཅེས་དེ་ལ་མོས་པ་སྐྱེད་ན། བློ་གྲོས་རྣམ་པར་དག་པ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེའི་མཐའ་བརྗོད་པར་མི་ནུས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་པའི་ཕྱིར་རོ།
en: Moreover, he may arouse devotion, thinking, ‘May my body become just like the bodies of the thus-gone ones, which are adorned with the thirty-two marks of a great being!’ Pure Intellect, in that case, the size of that heap of merit will be indescribable, because it is based on unsurpassed and perfect awakening.

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་རྒྱལ་པོ་ཉིད་དམ། བརྒྱ་བྱིན་ཉིད་དམ། ཚངས་པ་ཉིད་དམ། རང་སངས་རྒྱས་ཉིད་དམ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པས་ཀྱང་ཟད་པར་བྱ་བར་མི་ནུས་སོ།
en: That heap of merit cannot be exhausted by becoming a king, Śakra, Brahmā, a solitary buddha, or even a practitioner of the unsurpassed vehicle of the perfect buddhas.

source: བློ་གྲོས་རྣམ་པར་དག་པ་རིགས་ཀྱི་བུ་དེས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་ཏེ། བློ་གྲོས་རྣམ་པར་དག་པ་འདི་ལྟ་སྟེ།
en: Because, Pure Intellect, such a noble son is in possession of an inconceivable heap of merit.

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གྲོང་ཁྱེར་རམ། གཙུག་ལག་ཁང་ངམ།
en: Pure Intellect, consider the Thus-Gone One who has awakened to unsurpassed and perfect buddhahood.

source: གྲོང་དུ་འཇུག་ཀྱང་རུང་། འཆག་ཀྱང་རུང་། འགྲེང་ཡང་རུང་། འདུག་ཀྱང་རུང་། ཆོས་སྟོན་ཀྱང་རུང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། མིའམ། མི་མ་ཡིན་པའམ།
en: Whenever he is entering a city, a monastery, or a village, and whether he is walking, standing, sitting, or teaching the Dharma, all beings without exception in this great trichiliocosm—gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans—will bow, salute, and prostrate in his direction.

source: སེམས་ཅན་གྱི་གྲངས་སུ་མ་གཏོགས་པ་ཤིང་ངམ། རིའམ། ཁུང་བུའམ། བུ་གའམ། བྱ་སྐྱིབས་ཀྱང་རུང་སྟེ། དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེ་ལོགས་སུ་འདུད་པ་དང་རབ་ཏུ་འདུད་པ་དང་། ཀུན་ཏུ་འདུད་པ་མི་ཕྱེད་པ་དེ་གང་ཡང་མེད་དེ།
en: Even the trees, mountains, mines, caves, and rock shelters will do so.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་ལྡན་པ་ལ་བྱེད་པ་དེ་བཞིན་དུ། རིགས་ཀྱི་བུ་དེ་དག་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ཡུལ་འཁོར་རམ། ཕོ་བྲང་འཁོར་ན་རྒྱུ་བ་ལ་སེམས་ཅན་རྣམས་འདུད།
en: Just as they all behave toward the Thus-Gone One, who is endowed with all roots of virtue, so sentient beings will also bow, salute, and prostrate to such noble sons as they wander in villages, cities, towns, lands, or capitals.”

source: རབ་ཏུ་འདུད། ཀུན་ཏུ་འདུད་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: At that moment, the Blessed One uttered these verses: “When someone kneels before the stūpa of a buddha,

source: །འཇིག་རྟེན་སངས་རྒྱས་ཇི་ལྟར་འགྱུར་ཞེས་མོས་སྐྱེད་དེ།
en: Forms the wish to be like the buddhas in the world,

source: སངས་རྒྱས་མཆོད་རྟེན་ལ་ནི་པུས་མོ་གཉིས་འཛུགས་དང་། །སུ་ཞིག་བྱང་ཆུབ་གཞོལ་ནས་ཕྱོགས་རྣམས་ཀུན་འགྲོ་བ།
en: And is firmly intent on awakening,

source: །དེ་འགྲོ་ཚེ་ན་འཇིག་རྟེན་གསུམ་པོ་འདུད་པ་བྱེད།
en: The three worlds will bow to him, wherever he goes.

source: །མི་རྣམས་གཙོ་བོ་རང་བྱུང་གང་དུ་འགྲོ་བྱེད་པ།
en: “Wherever that self-arisen chief of humans goes,

source: །དེ་ལོགས་སུ་ནི་རྩྭ་དང་ཤིང་དང་སྡོང་དུམ་དང་། །སྨན་དང་ཤིང་ལོ་རྣམས་དང་འབྲས་བུ་འདབ་མ་དང་། །ཡིད་འོང་དྲི་ལྡན་མེ་ཏོག་རྣམས་ནི་འདུད་པར་འགྱུར།
en: All the grass, trees, branches, Herbs, leaves, fruits, flower petals, And fragrant flowers will bow in that direction. “All the rulers of humans will bow down

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་པུས་མོ་བཙུགས་པ་ནི། །དེ་ལ་མི་ཡི་དབང་པོ་ཀུན་ཀྱང་འདུད་པར་འགྱུར།
en: To the person who kneels before the stūpas of the blessed ones.

source: །གནོད་སྦྱིན་དབང་དང་ཀླུ་དང་ལྷ་ཡི་རྒྱལ་པོ་དང་། །ཚངས་པའི་དབང་པོ་ཐམས་ཅད་རྐང་པར་གཏུགས་པར་བྱེད།
en: The lord of the yakṣas, the king of the nāgas, the king of the gods, And the lord Brahmā will all bow at his feet.

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་པུས་བཙུགས་ཕྱག་བྱས་ན།
en: “If someone kneels and prostrates before the stūpas of the blessed ones,

source: །དཔའ་ཞིང་སྟོབས་དང་ལྡན་པའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: He will become a heroic and powerful universal monarch,

source: །གསེར་གྱི་མདོག་ལྡན་མཚན་རྣམས་ཀྱིས་ནི་གོ་ཆར་འགྱུར།
en: Adorned with a golden complexion and wearing the armor of the marks.

source: །མཐུ་ཆེ་བླ་མར་བྱ་ཞིང་ཐུབ་པར་དཀའ་བར་འགྱུར།
en: His great might will be respected and hard to overcome.

source: །དེ་ཡི་ཡུལ་ན་སེམས་ཅན་གང་དག་གནས་གྱུར་པ།
en: “All the sentient beings residing in his lands

source: །དེ་དག་ཐམས་ཅད་བྱམས་པའི་སེམས་དང་དགའ་བར་འགྱུར།
en: Will be kind and joyful,

source: །དེ་ལ་སེམས་ཅན་གང་ཡང་སྡིག་པ་མི་སྐྱེད་དེ།
en: And no one will commit any evil deed toward him.

source: །སྐྱེ་བོ་ཚོགས་ཆེན་དགའ་ཞིང་ཡིད་དུ་འོང་བར་འགྱུར།
en: Those great assemblies of beings will be joyful and charming. “A world ruler will salute

source: །བཅོམ་ལྡན་མཆོད་རྟེན་དག་ལ་པུས་བཙུགས་ཕྱག་འཚལ་བ། །དེ་ལ་འཇིག་རྟེན་ཀུན་གྱི་རྒྱལ་པོ་རབ་ཏུ་འདུད།
en: Someone who kneels and pays homage to the stūpas of the blessed ones.

source: །ལྷ་དང་ཀླུ་དང་མི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་འདུད།
en: The gods, nāgas, humans, and mahoragas will bow down to him,

source: །བསྐལ་པ་མཐའ་ཡས་རྣམས་སུ་དབུགས་ཕྱིན་ཐོབ་པར་འགྱུར།
en: And he will find relief for limitless eons. “When the sublime victorious ones appear,

source: །བཅོམ་ལྡན་མཆོད་རྟེན་དག་ལ་པུས་བཙུགས་ཕྱག་འཚལ་བ། །གང་ཚེ་རྒྱལ་བ་དམ་པ་བྱུང་བར་གྱུར་པའི་ཚེ།
en: The person who kneels and pays homage to the stūpas of the blessed ones

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་དང་ཉེ་བར་འགྱུར་བ་འཐོབ།
en: Will come in close contact with these thus-gone ones,

source: །འདྲེན་པ་གཞལ་ཡས་རྣམས་ལ་མཆོད་པ་བྱེད་པར་འགྱུར།
en: And will worship countless such great leaders.

source: །འཇིག་རྟེན་སངས་རྒྱས་གྱུར་ཅེས་མོས་པ་བསྐྱེད་ནས་ནི།
en: “When myriads of eons have passed,

source: །བཅོམ་ལྡན་མཆོད་རྟེན་རྣམས་ལ་པུས་བཙུགས་ཕྱག་འཚལ་བ།
en: The person who kneels and pays homage to the stūpas of the blessed ones,

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་བགྲངས་ཟད་འགྱུར་ན།
en: With the wish to become a buddha in the world,

source: །དེ་ནི་རིང་པོར་མི་ཐོགས་བྱང་ཆུབ་མཚུངས་མེད་འཐོབ།
en: Will swiftly reach the unequalled state of awakening.

source: །གང་ཞིག་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལ།
en: “Compared to someone who honors myriads of buddhas

source: །བསྐལ་པ་བྱེ་བ་གཞལ་ཡས་བསྟི་སྟང་བྱེད་པ་བས།
en: For countless millions of eons,

source: །གང་ཞིག་ཕྱི་དུས་མི་བཟད་བསྐལ་པ་འདི་ལ་ནི།
en: Someone who, in the terrible future age of this eon,

source: །མཆོད་རྟེན་ཕྱག་འཚལ་དེ་ཡི་བསོད་ནམས་ཆེས་མང་ངོ་།
en: Pays homage to a stūpa will accrue much more merit.

source: །སངས་རྒྱས་དམ་པ་སྦྱིན་གནས་མཚུངས་པ་མེད་གྱུར་པ།
en: “The sublime buddhas are unequalled objects of generosity,

source: །སྤྱོད་པ་དམ་པ་སྤྱད་ནས་ཁྱད་པར་བརྙེས་གྱུར་པ།
en: Who reached unique attainments by engaging in sacred conduct.

source: །མི་ཡི་ཁྱུ་མཆོག་དེ་ལ་འདིར་ནི་མཆོད་བྱས་ན།
en: If someone worships these foremost of humans,

source: །རྣམ་པར་སྨིན་པ་དམ་པ་མཚུངས་མེད་རང་བཞིན་འགྱུར། །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྔོས་ཏེ།
en: He will develop an unequalled, sublime nature when these actions ripen.

source: །མེ་ཏོག་ཕྲེང་བ་བྱས་ནས་སུ།
en: “Whoever makes flower garlands

source: །མཆོད་རྟེན་དག་ལ་སུ་འབུལ་བ།
en: And offers them to stūpas, While directing his mind toward awakening,

source: །དེ་ནི་ནམས་ཀྱང་ཕོངས་མི་འགྱུར།
en: Will never become destitute.

source: །མི་ཡི་ནང་ནས་ཤི་འཕོས་ནས།
en: “After his death, upon leaving the human realm,

source: །སུམ་ཅུ་རྩ་གསུམ་འགྲོ་བར་འགྱུར།
en: He will be reborn in the Heaven of the Thirty-Three, Where he will receive a palace

source: །དེར་ནི་རིན་ཆེན་སྣ་ཚོགས་ཀྱི། །གཞལ་མེད་ཁང་པ་འཐོབ་པར་འགྱུར།
en: Made of all kinds of precious gems.

source: །མཆོད་རྟེན་ཕྲེང་བ་འདིར་ཕུལ་ན།
en: “If someone offers a garland to a stūpa, He will enjoy the pleasures of the Heaven of the Thirty-Three,

source: །ཁང་བཟངས་དག་དང་ཁང་བརྩེགས་པ།
en: Where he will live in divine mansions and pavilions,

source: །ལྷ་ཡི་བུ་མོས་བསྟེན་པ་རྣམས།
en: Attended by celestial maidens. “He will enjoy divine pools

source: །སུམ་ཅུ་གསུམ་དུ་སྤྱོད་པར་འགྱུར།
en: Made of beryl and crystal,

source: །ཡན་ལག་བརྒྱད་ལྡན་ཆུས་གང་ཞིང་།
en: Filled with water having the eight qualities,

source: །གསེར་གྱི་བྱེ་མ་བདལ་གྱུར་པ། །བཻ་དཱུརྱ་དང་ཤེལ་དག་གི། །ལྷ་ཡི་རྫིང་བུ་འཐོབ་པར་འགྱུར།
en: And spread with golden sand.

source: །དེར་ནི་ལྷ་ཡི་དགའ་སྤྱད་ནས།
en: “After enjoying his time among the gods,

source: །མཁས་པ་ཚེ་ཚད་རྫོགས་པར་འགྱུར།
en: When his lifespan is exhausted,

source: །ལྷ་ཡི་འཇིག་རྟེན་ཤི་འཕོས་ནས།
en: This wise man will depart from the gods’ realm,

source: །མི་ནང་ལོངས་སྤྱོད་ལྡན་པར་འགྱུར།
en: And be reborn as a prosperous man.
